src/org/test.org
#+TITLE: test

fdasfd
fdsafdsafds
#+begin_example
(let ((minver "25.1"))
  (when (version< emacs-version minver)
    (error "Your Emacs is too old -- this config requires v%s or higher" minver)))
(when (version< emacs-version "26.1")
  (message "Your Emacs is old, and some functionality in this config will be disabled. Please upgrade if possible."))

(add-to-list 'load-path (expand-file-name "lisp" user-emacs-directory))
(require 'init-benchmarking) ;; Measure startup time

(defconst *spell-check-support-enabled* nil) ;; Enable with t if you prefer
(defconst *is-a-mac* (eq system-type 'darwin))
#+end_example

#+begin_src emacs-lisp
(let ((minver "25.1"))
  (when (version< emacs-version minver)
    (error "Your Emacs is too old -- this config requires v%s or higher" minver)))
(when (version< emacs-version "26.1")
  (message "Your Emacs is old, and some functionality in this config will be disabled. Please upgrade if possible."))

(add-to-list 'load-path (expand-file-name "lisp" user-emacs-directory))
(require 'init-benchmarking) ;; Measure startup time

(defconst *spell-check-support-enabled* nil) ;; Enable with t if you prefer
(defconst *is-a-mac* (eq system-type 'darwin))
#+end_src


testadfasfdsafdsfdsafdsa
fdsa
fdasfdasfsdf
fdsafds

fdafdsafdasfds
adsafdsafdsa

fasfdsafdsa
fdasfdsafds

#+begin_example
fdsafdsafd
#+end_example
fdasfdsafdsa


dfsafdsafds

fdafsdf
fdsafdsafdas
fdasfdsafdas

fdsafdsafdsafdsa

fdsafdsafds
fdsafdsafd
fdasfsd
